
public class 변수문자열_52 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// Java 13 => 파이썬 => 53page
		String news="음뵈모는 “맨체스터 유나이티드에 합류할 기회가 생기자마자, 그 기회를 반드시 잡아야 했다. 어릴 적부터 이 유니폼을 입었고, 이곳은 제가 항상 동경해온 팀”이라며 드림 클럽 이적에 크게 감격했다.\r\n"
				+ "\r\n"
				+ "음뵈모는 후벵 아모림 감독이 이끄는 맨유 유나이티드의 세 번째 영입이다. 맨체스터 유나이티드는 여름 이적 시장이 열리자마자 브라질 공격수 마테우스 쿠냐, 왼쪽 풀백 디에고 레온을 영입했다.";
		System.out.println(news);
		System.out.println("");
		System.out.println("");
		String news1="""
				음뵈모는 “맨체스터 유나이티드에 합류할 기회가 생기자마자, 그 기회를 반드시 잡아야 했다.
				어릴 적부터 이 유니폼을 입었고, 이곳은 제가 항상 동경해온 팀”이라며 드림 클럽 이적에 크게 감격했다.\r\n
				음뵈모는 후벵 아모림 감독이 이끄는 맨유 유나이티드의 세 번째 영입이다.
				맨체스터 유나이티드는 여름 이적 시장이 열리자마자 브라질 공격수 마테우스 쿠냐, 왼쪽 풀백 디에고 레온을 영입했다.
				
				""";
		System.out.println(news1);
	}

}
